Azure/src/DataProcessors/СохранитьФайл/СохранитьФайл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СохранитьФайл</name>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShareName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DirectoryPath</name>
    <comment>Путь по которому будет создан файл (напр. files\)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьMD5</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИерархиюПапок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Azure/src/DataProcessors/СохранитьФайл/Forms/Форма/Module.bsl
#Область ОбработкаСобытийФормы
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	
	ОП = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект); 
	
	Диалог.Показать(ОП);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопНастройки) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли; 			
КонецПроцедуры


#Область ОбработкаКомандФормы
&НаСервере
Функция СохранитьФайлНаСервере()
	Файл = Новый Файл(Объект.ПутьКФайлу);
	
	МетаТегиСохранить = Новый Структура;
	
	Для каждого МетаТег Из МетаТеги Цикл
		МетаТегиСохранить.Вставить(МетаТег.Тег, МетаТег.Значение);	
	КонецЦикла; 
	
	СтатусОтвет = AzureВызовСервера.СохранитьФайлAzureFile(
		Объект.СтрокаПодключения,
		Новый ДвоичныеДанные(Объект.ПутьКФайлу),
		Файл.Имя,
		Объект.ShareName,
		Объект.DirectoryPath,
		Объект.СохранитьMD5,
		Объект.СоздаватьИерархиюПапок,
		МетаТегиСохранить
	);
	
	Возврат СтатусОтвет;
КонецФункции

&НаКлиенте
Процедура СохранитьФайл(Команда)
	СтатусОтвет = СохранитьФайлНаСервере();
	ВспомогательныйКлиент.ВывестиСтатус(СтатусОтвет);
КонецПроцедуры
#КонецОбласти 

#КонецОбласти
